taskt/Core/Automation/Commands/ExcelGroup/IExcelWorksheetCopyRenameProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IExcelWorksheetCopyRenameProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.ExcelCopyWorksheetCommand" [ label="ExcelCopyWorksheetCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.IExcelWorksheetCopyRenameProperties" [ label="IExcelWorksheetCopyRenameProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ExcelRenameWorksheetCommand" [ label="ExcelRenameWorksheetCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.ExcelCopyWorksheetCommand" -> "taskt.Core.Automation.Commands.IExcelWorksheetCopyRenameProperties";
"taskt.Core.Automation.Commands.ExcelRenameWorksheetCommand" -> "taskt.Core.Automation.Commands.IExcelWorksheetCopyRenameProperties";
}
